[
  {
    "stage_name": "Narrative",
    "content": "TERM: Generational Legacy\n\nDEFINITION:\nThe patterns, disturbances, and systemic effects that propagate across multiple generations in family systems, as described by Bert Hellinger. Like waves and ripples in a river caused by an upstream boulder that still affect the flow far downstream, disturbances in earlier generations continue to influence later generations. Children's innocent love can blindly perpetuate harmful patterns. Injuries to the Orders of Love by earlier family members affect the lives of later members. These generational effects operate through systemic conscience, hidden loyalties, and unconscious identifications. Recognition and appropriate acknowledgment of generational patterns can restore balance and allow love to flow again.\n\nBLUEPRINT DETAILS:\nGenerational patterns operate across long time horizons. Children may unconsciously take on parental burdens or identify with excluded ancestors. Application: When performing TemporalDynamiX analysis or FutureStateAnalysiS, consider multi-generational time horizons. Patterns may emerge that require looking back generations to understand current system state.\n\nEXAMPLE APPLICATION:\nIn analyzing persistent organizational dysfunction, applying GenerationallegacY principles revealed patterns that originated in the organization's founding generation - exclusion of key founders, unresolved conflicts - that continued to affect dynamics decades later, similar to family generational patterns.\n\nCATEGORY: CorePrinciple\n\nRELATIONSHIPS:\ntype: TemporalSystemicPattern; part_of: TemporalDynamiX, 4d thinkinG; propagates_through: SystemicconsciencE, SystemicentanglemenT, Hidden loyalties; caused_by: Violations of OrdersoflovE, Exclusion of family members, Unresolved tragedies, Systemic imbalances; affects: Future generations, Children's behavior, Relationship patterns, System health; recognized_through: FamilyconstellationDynamiC, Pattern analysis, Historical contextualization; restored_through: Acknowledgment of patterns, Recognition of excluded members, Restoration of systemic balance, Honoring the orders; temporal_scope: Multi-generational, Decades to centuries, Beyond individual lifespan; source: Bert Hellinger - Love's Hidden Symmetry, Chapter 4; confidence: high",
    "compression_ratio": 1.0,
    "symbol_count": 2250,
    "timestamp": "2025-11-18T10:46:47.972775Z"
  },
  {
    "stage_name": "Concise",
    "content": "TERM: Generational Legacy\n\nDEFINITION:\nThe patterns, disturbances, and systemic effects that propagate across multiple generations in family systems, as described by Bert Hellinger. Like waves and ripples in a river caused by an upstream boulder that still affect the flow far downstream, disturbances in earlier generations continue to influence later generations. Children's innocent love can blindly perpetuate harmful patterns. Injuries to the Orders of Love by earlier family members affect the lives of later members. These generational effects operate through systemic conscience, hidden loyalties, and unconscious identifications. Recognition and appropriate acknowledgment of generational patterns can restore balance and allow love to flow again.\n\nBLUEPRINT DETAILS:\nGenerational patterns operate across long time horizons. Children may unconsciously take on parental burdens or identify with excluded ancestors. Application: When performing TemporalDynamiX analysis or FutureStateAnalysiS, consider multi-generational time horizons. Patterns may emerge that require looking back generations to understand current s",
    "compression_ratio": 2.0,
    "symbol_count": 1125,
    "timestamp": "2025-11-18T10:46:47.972796Z"
  },
  {
    "stage_name": "Nano",
    "content": "TERM: Generational Legacy D: patterns, disturbances, Sic effects propagate across multiple generations in family Ss, as described by Bert Hellinger. Like waves ripples in a river caused by an upstream boulder still affect flow far downstream, disturbances in earlier generations continue to influence later generations. Children's innocent love blindly perpetuate harmful patterns. Injuries to Orders of Love by earlier family members affect lives of later members. These generational effects operate through Sic conscience, hidden loyalties, unconscious identifications. Recognition appropriate acKnOwledgment of generational patterns restore balance allow love to flow again. BLUEPRINT DETAILS: Generational patterns operate across long time horizons. Children may unconsciously take on parental burdens or identify excluded ancestors. Application: performing TemporalDynamiX analysis or FutureStateAnalysiS, consider multi-generational time horizons. Patterns may emerge require looking back generations to understand current s",
    "compression_ratio": 2.1844660194174756,
    "symbol_count": 1030,
    "timestamp": "2025-11-18T10:46:47.982754Z"
  },
  {
    "stage_name": "Micro",
    "content": "TERM: Generational Legacy D: patterns, disturbances, Sic effects propagate across multiple generations family Ss, described Bert Hellinger. Like waves ripples river caused upstream boulder still affect downstream, disturbances earlier generations continue influence later generations. Children's innocent blindly perpetuate harmful patterns. Injuries Orders Love earlier family members affect lives later members. These generational effects operate through Sic conscience, hidden loyalties, unconscious identifications. Recognition appropriate acKnOwledgment generational patterns restore balance allow again. BLUEPRINT DETAILS: Generational patterns operate across horizons. Children unconsciously parental burdens identify excluded ancestors. Application: performing TemporalDynamiX analysis FutureStateAnalysiS, consider multi-generational horizons. Patterns emerge require looking generations understand current",
    "compression_ratio": 2.459016393442623,
    "symbol_count": 915,
    "timestamp": "2025-11-18T10:46:47.997637Z"
  },
  {
    "stage_name": "Pico",
    "content": "TERM: Generational Legacy D: patterns, disturbances, Sic effects propagate across multiple generations family Ss, described Bert Hellinger. Like waves ripples river caused upstream boulder still affect downstream, disturbances earlier generations continue influence later generations. Children's innocent blindly perpetuate harmful patterns. Injuries Orders Love earlier family members affect lives later members. These generational effects operate through Sic conscience, hidden loyalties, unconscious identifications. Recognition appropriate acKnOwledgment generational patterns restore balance allow again. BLUEPRINT DETAILS: Generational patterns operate across horizons. Children unconsciously parental burdens identify excluded ancestors. Application: performing TemporalDynamiX analysis FutureStateAnalysiS, consider multi-generational horizons. Patterns emerge require looking generations understand current",
    "compression_ratio": 2.459016393442623,
    "symbol_count": 915,
    "timestamp": "2025-11-18T10:46:48.013331Z"
  },
  {
    "stage_name": "Femto",
    "content": "TERM: Generational Legacy D: patterns, disturbances, Sic effects propagate across multiple generations family Ss, described Bert Hellinger. Like waves ripples river caused upstream boulder still affect downstream, disturbances earlier generations continue influence later generations. Children's innocent blindly perpetuate harmful patterns. Injuries Orders Love earlier family members affect lives later members. These generational effects operate through Sic conscience, hidden loyalties, unconscious identifications. Recognition appropriate acKnOwledgment generational patterns restore balance allow again. BLUEPRINT DETAILS: Generational patterns operate across horizons. Children unconsciously parental burdens identify excluded ancestors. Application: performing TemporalDynamiX analysis FutureStateAnalysiS, consider multi-generational horizons. Patterns emerge require looking generations understand current",
    "compression_ratio": 2.459016393442623,
    "symbol_count": 915,
    "timestamp": "2025-11-18T10:46:48.031787Z"
  },
  {
    "stage_name": "Atto",
    "content": "TERM: Generational Legacy D: Sic Ss, Bert Hellinger. Like Children's Injuries Orders Love These Sic Recognition BLUEPRINT DETAILS: Generational Children Application: TemporalDynamiX FutureStateAnalysiS, Patterns",
    "compression_ratio": 10.663507109004739,
    "symbol_count": 211,
    "timestamp": "2025-11-18T10:46:48.052777Z"
  },
  {
    "stage_name": "Zepto",
    "content": "G|L|S|S|B",
    "compression_ratio": 250.0,
    "symbol_count": 9,
    "timestamp": "2025-11-18T10:46:48.053104Z"
  }
]