[
  {
    "stage_name": "Narrative",
    "content": "TERM: Family Constellation Dynamics\n\nDEFINITION:\nThe method and phenomenon of making hidden systemic dynamics visible through representative positioning, as developed and refined by Bert Hellinger. In family constellations, representatives (who don't know the family members) are positioned to represent family members and begin to experience feelings and thoughts very close to those the actual family members felt - without prior knowledge. This phenomenon makes visible the normally hidden dynamics operating in relationship systems. The method extends beyond making destructive dynamics visible - it can help identify what can be done to restore systemic balance and allow the hidden orders that love requires to be reestablished. Sometimes behaviors of family members not even present change for the better after a constellation has been brought to a good resolution.\n\nBLUEPRINT DETAILS:\nFamily constellations reveal hidden systemic dynamics through representative positioning. The phenomenon demonstrates that systemic information is accessible non-verbally. Application: In ComplexsystemvisioninG, consider how system representatives (agents, stakeholders) may provide information about system state beyond what their explicit rules or data would suggest - similar to how constellation representatives access family field information.\n\nEXAMPLE APPLICATION:\nIn modeling organizational culture, applying FamilyconstellationDynamiC principles suggested that 'representative' agents (modeling different departments) might reveal systemic dynamics through their emergent positioning and interactions that weren't explicitly programmed, similar to how constellation representatives access family information.\n\nCATEGORY: Methodology\n\nRELATIONSHIPS:\ntype: SystemicVisualizationMethod; makes_visible: HiddensymmetrY, SystemicconsciencE, OrdersoflovE, SystemicentanglemenT; uses_phenomenon: Representative perception, Non-verbal information access, Systemic field effects; extends_to: Restoring systemic balance, Identifying interventions, Reestablishing orders; related_to: ComplexsystemvisioninG, System modeling, Emergent behavior recognition; applies_principles_of: Systemic balance, Hidden symmetry, Systemic conscience; demonstrates: Systemic forces operating, Non-local effects, System intelligence; source: Bert Hellinger - Love's Hidden Symmetry; confidence: high",
    "compression_ratio": 1.0,
    "symbol_count": 2369,
    "timestamp": "2025-11-18T10:46:47.486865Z"
  },
  {
    "stage_name": "Concise",
    "content": "TERM: Family Constellation Dynamics\n\nDEFINITION:\nThe method and phenomenon of making hidden systemic dynamics visible through representative positioning, as developed and refined by Bert Hellinger. In family constellations, representatives (who don't know the family members) are positioned to represent family members and begin to experience feelings and thoughts very close to those the actual family members felt - without prior knowledge. This phenomenon makes visible the normally hidden dynamics operating in relationship systems. The method extends beyond making destructive dynamics visible - it can help identify what can be done to restore systemic balance and allow the hidden orders that love requires to be reestablished. Sometimes behaviors of family members not even present change for the better after a constellation has been brought to a good resolution.\n\nBLUEPRINT DETAILS:\nFamily constellations reveal hidden systemic dynamics through representative positioning. The phenomenon demonstrates that systemic information is accessible non-verbally. Application: In ComplexsystemvisioninG, consider how system representatives (agents, stakeholders) may provide informat",
    "compression_ratio": 2.0008445945945947,
    "symbol_count": 1184,
    "timestamp": "2025-11-18T10:46:47.486884Z"
  },
  {
    "stage_name": "Nano",
    "content": "TERM: Family Constellation Dynamics D: method phenomenon of making hidden Sic dynamics visible through representative positioning, as developed refined by Bert Hellinger. In family constellations, representatives (who don't KnOw family members) positioned to represent family members begin to experience feelings thoughts very close to those actual family members felt - without prior KnOwledge. phenomenon makes visible normally hidden dynamics operating in relationship Ss. method extends beyond making destructive dynamics visible - it help identify be done to restore Sic balance allow hidden orders love requires to be reestablished. Sometimes behaviors of family members even present change better after a constellation has been brought to a good resolution. BLUEPRINT DETAILS: Family constellations reveal hidden Sic dynamics through representative positioning. phenomenon demonstrates Sic inFion is accessible non-verbally. Application: In ComplexSvisioninG, consider how S representatives (agents, stakeholders) may provide inF",
    "compression_ratio": 2.2866795366795367,
    "symbol_count": 1036,
    "timestamp": "2025-11-18T10:46:47.491719Z"
  },
  {
    "stage_name": "Micro",
    "content": "TERM: Family Constellation Dynamics D: method phenomenon making hidden Sic dynamics visible through representative positioning, developed refined Bert Hellinger. In family constellations, representatives don't KnOw family members) positioned represent family members begin experience feelings thoughts close those actual family members without prior KnOwledge. phenomenon makes visible normally hidden dynamics operating relationship Ss. method extends beyond making destructive dynamics visible identify restore Sic balance allow hidden orders requires reestablished. Sometimes behaviors family members present change better after constellation brought resolution. BLUEPRINT DETAILS: Family constellations reveal hidden Sic dynamics through representative positioning. phenomenon demonstrates Sic inFion accessible non-verbally. Application: In ComplexSvisioninG, consider S representatives (agents, stakeholders) provide",
    "compression_ratio": 2.56941431670282,
    "symbol_count": 922,
    "timestamp": "2025-11-18T10:46:47.496345Z"
  },
  {
    "stage_name": "Pico",
    "content": "TERM: Family Constellation Dynamics D: method phenomenon making hidden Sic dynamics visible through representative positioning, developed refined Bert Hellinger. In family constellations, representatives don't KnOw family members) positioned represent family members begin experience feelings thoughts close those actual family members without prior KnOwledge. phenomenon makes visible normally hidden dynamics operating relationship Ss. method extends beyond making destructive dynamics visible identify restore Sic balance allow hidden orders requires reestablished. Sometimes behaviors family members present change better after constellation brought resolution. BLUEPRINT DETAILS: Family constellations reveal hidden Sic dynamics through representative positioning. phenomenon demonstrates Sic inFion accessible non-verbally. Application: In ComplexSvisioninG, consider S representatives (agents, stakeholders) provide",
    "compression_ratio": 2.56941431670282,
    "symbol_count": 922,
    "timestamp": "2025-11-18T10:46:47.510733Z"
  },
  {
    "stage_name": "Femto",
    "content": "TERM: Family Constellation Dynamics D: method phenomenon making hidden Sic dynamics visible through representative positioning, developed refined Bert Hellinger. family constellations, representatives don't KnOw family members) positioned represent family members begin experience feelings thoughts close those actual family members without prior KnOwledge. phenomenon makes visible normally hidden dynamics operating relationship Ss. method extends beyond making destructive dynamics visible identify restore Sic balance allow hidden orders requires reestablished. Sometimes behaviors family members present change better after constellation brought resolution. BLUEPRINT DETAILS: Family constellations reveal hidden Sic dynamics through representative positioning. phenomenon demonstrates Sic inFion accessible non-verbally. Application: ComplexSvisioninG, consider S representatives (agents, stakeholders) provide",
    "compression_ratio": 2.586244541484716,
    "symbol_count": 916,
    "timestamp": "2025-11-18T10:46:47.516727Z"
  },
  {
    "stage_name": "Atto",
    "content": "TERM: Family Constellation Dynamics D: Sic Bert Hellinger. KnOw KnOwledge. Ss. Sic Sometimes BLUEPRINT DETAILS: Family Sic Sic Application: ComplexSvisioninG, S",
    "compression_ratio": 14.80625,
    "symbol_count": 160,
    "timestamp": "2025-11-18T10:46:47.520069Z"
  },
  {
    "stage_name": "Zepto",
    "content": "F|C|D|S|B",
    "compression_ratio": 263.22222222222223,
    "symbol_count": 9,
    "timestamp": "2025-11-18T10:46:47.520755Z"
  }
]