[
  {
    "stage_name": "Narrative",
    "content": "TERM: Greater Soul\n\nDEFINITION:\nThe transcendent intelligence and source of systemic wisdom that supports love, as described by Bert Hellinger. The Greater Soul represents the intelligence of the systemic symmetry of love operating unseen in relationships, watching over love itself. It is the source of the orders that govern relationship systems and provides the context within which individual relationships exist. Recognition of the Greater Soul allows one to know the intelligence that supports love and to align actions with systemic wisdom rather than personal will or social convention. This concept acknowledges that relationships exist within a larger spiritual or systemic context that transcends individual consciousness.\n\nBLUEPRINT DETAILS:\nThe Greater Soul represents transcendent systemic intelligence supporting love. Recognition requires humility and alignment with orders rather than personal will. Application: In ethical decision-making and high-stakes scenarios, consider alignment with Greater Soul principles - systemic wisdom, love's requirements, orders that serve the whole rather than individual interests.\n\nEXAMPLE APPLICATION:\nIn evaluating organizational restructuring proposals, applying GreatersouL principles helped recognize that proposals serving individual interests while violating systemic orders would ultimately fail, even if logically sound, because they ignored the intelligence supporting systemic health.\n\nCATEGORY: SpiritualPrinciple\n\nRELATIONSHIPS:\ntype: TranscendentIntelligence; is_source_of: OrdersoflovE, HiddensymmetrY, Systemic wisdom; supports: Love itself, Systemic health, Relationship success; transcends: Individual consciousness, Personal will, Social convention; recognized_through: Observation of systemic intelligence, Love's increase or diminishment, Alignment with orders; requires: Humility, Recognition of limits, Submission to orders; guides: Systemic balance, Relationship restoration, Therapeutic interventions; related_to: ResonantgratidsouL, SynergisticFusionProtocol, Spiritual technology; source: Bert Hellinger - Love's Hidden Symmetry, Chapter 5; confidence: high",
    "compression_ratio": 1.0,
    "symbol_count": 2137,
    "timestamp": "2025-11-18T10:46:48.073464Z"
  },
  {
    "stage_name": "Concise",
    "content": "TERM: Greater Soul\n\nDEFINITION:\nThe transcendent intelligence and source of systemic wisdom that supports love, as described by Bert Hellinger. The Greater Soul represents the intelligence of the systemic symmetry of love operating unseen in relationships, watching over love itself. It is the source of the orders that govern relationship systems and provides the context within which individual relationships exist. Recognition of the Greater Soul allows one to know the intelligence that supports love and to align actions with systemic wisdom rather than personal will or social convention. This concept acknowledges that relationships exist within a larger spiritual or systemic context that transcends individual consciousness.\n\nBLUEPRINT DETAILS:\nThe Greater Soul represents transcendent systemic intelligence supporting love. Recognition requires humility and alignment with orders rather than personal will. Application: In ethical decision-making and high-stakes scenarios, consider alignment with Greater Soul principles - systemic wisdom, love's requiremen",
    "compression_ratio": 2.000936329588015,
    "symbol_count": 1068,
    "timestamp": "2025-11-18T10:46:48.073487Z"
  },
  {
    "stage_name": "Nano",
    "content": "TERM: Greater Soul D: transcendent intelligence source of Sic wisdom supports love, as described by Bert Hellinger. Greater Soul represents intelligence of Sic symmetry of love operating unseen in relationships, watching over love itself. It is source of orders govern relationship Ss provides context within individual relationships exist. Recognition of Greater Soul allows one to KnOw intelligence supports love to align actions Sic wisdom rather than personal will or social convention. concept acKnOwledges relationships exist within a larger spiritual or Sic context transcends individual consciousness. BLUEPRINT DETAILS: Greater Soul represents transcendent Sic intelligence supporting love. Recognition requires humility alignment orders rather than personal will. Application: In ethical decision-making high-stakes scenarios, consider alignment Greater Soul principles - Sic wisdom, love's requiremen",
    "compression_ratio": 2.3457738748627883,
    "symbol_count": 911,
    "timestamp": "2025-11-18T10:46:48.082343Z"
  },
  {
    "stage_name": "Micro",
    "content": "TERM: Greater Soul D: transcendent intelligence source Sic wisdom supports love, described Bert Hellinger. Greater Soul represents intelligence Sic symmetry operating unseen relationships, watching itself. It source orders govern relationship Ss provides context within individual relationships exist. Recognition Greater Soul allows KnOw intelligence supports align actions Sic wisdom rather personal social convention. concept acKnOwledges relationships exist within larger spiritual Sic context transcends individual consciousness. BLUEPRINT DETAILS: Greater Soul represents transcendent Sic intelligence supporting love. Recognition requires humility alignment orders rather personal Application: In ethical decision-making high-stakes scenarios, consider alignment Greater Soul principles Sic wisdom, love's requiremen",
    "compression_ratio": 2.5965978128797085,
    "symbol_count": 823,
    "timestamp": "2025-11-18T10:46:48.094398Z"
  },
  {
    "stage_name": "Pico",
    "content": "TERM: Greater Soul D: transcendent intelligence source Sic wisdom supports love, described Bert Hellinger. Greater Soul represents intelligence Sic symmetry operating unseen relationships, watching itself. It source orders govern relationship Ss provides context within individual relationships exist. Recognition Greater Soul allows KnOw intelligence supports align actions Sic wisdom rather personal social convention. concept acKnOwledges relationships exist within larger spiritual Sic context transcends individual consciousness. BLUEPRINT DETAILS: Greater Soul represents transcendent Sic intelligence supporting love. Recognition requires humility alignment orders rather personal Application: In ethical decision-making high-stakes scenarios, consider alignment Greater Soul principles Sic wisdom, love's requiremen",
    "compression_ratio": 2.5965978128797085,
    "symbol_count": 823,
    "timestamp": "2025-11-18T10:46:48.099604Z"
  },
  {
    "stage_name": "Femto",
    "content": "TERM: Greater Soul D: transcendent intelligence source Sic wisdom supports love, described Bert Hellinger. Greater Soul represents intelligence Sic symmetry operating unseen relationships, watching itself. It source orders govern relationship Ss provides context within individual relationships exist. Recognition Greater Soul allows KnOw intelligence supports align actions Sic wisdom rather personal social convention. concept acKnOwledges relationships exist within larger spiritual Sic context transcends individual consciousness. BLUEPRINT DETAILS: Greater Soul represents transcendent Sic intelligence supporting love. Recognition requires humility alignment orders rather personal Application: ethical decision-making high-stakes scenarios, consider alignment Greater Soul principles Sic wisdom, love's requiremen",
    "compression_ratio": 2.6060975609756096,
    "symbol_count": 820,
    "timestamp": "2025-11-18T10:46:48.111689Z"
  },
  {
    "stage_name": "Atto",
    "content": "TERM: Greater Soul D: Sic Bert Hellinger. Greater Soul Sic It Ss Recognition Greater Soul KnOw Sic Sic BLUEPRINT DETAILS: Greater Soul Sic Recognition Application: Greater Soul Sic",
    "compression_ratio": 11.872222222222222,
    "symbol_count": 180,
    "timestamp": "2025-11-18T10:46:48.129068Z"
  },
  {
    "stage_name": "Zepto",
    "content": "G|S|S|B|H",
    "compression_ratio": 237.44444444444446,
    "symbol_count": 9,
    "timestamp": "2025-11-18T10:46:48.131011Z"
  }
]